[
    "My current car is a 2012 Prius and I hate it.",
    "I have no siblings and all my first cousins are 25+ years older than me.",
    "I don't drink coffee or soda.",
    "My favorite video game genres are RPGs, Adventure, Strategy, and Platformers.",
    "When Ben & Jerry's re-released Candy Bar Pie as slices I got way too excited and was super let down by how they tasted nothing like the original limited batch from 2014.",
    "This website's background is inspired by the title screen for Metroid Prime Trilogy.",
    "The only episode of Breaking Bad I ever watched was the last one.",
    "I drove an hour through a snowstorm on St. Patrick's day to get my first driver's license. But the test proctor was at his mother's funeral so I had to come back a few days later.",
    "On my first day at my first real job, there was an insurrection at the United States Capitol Building.",
    "I was born dehydrated.",
    "I've been a certified lifeguard since 2015.",
    "Arby's, Game informer and Ben & Jerry's all follow me on Twitter. I'm only a customer for one of them though.",
    "My favorite movie is Hot Rod.",
    "Multiple people have told me I look like John Mulaney and I've told multiple people that they are wrong.",
    "I have all 4 wisdom teeth.",
    "I think laser thermometers are really really cool.",
    "The only thing I can bring myself to order and Molly's in Hanover NH is their Chicken Carbonara",
    "I was banned on Twitter for 6 months in 2018 for lying about my age in 2011.",
    "I won the civil war Jeopardy tournament in fifth grade and the prize was bragging rights. So there.",
    "My greatest video game achievement is beating Pikmin 3 100% in one day.",
    "I was both the first former camper and the youngest person to ever join the director's leadership team at my summer camp.",
    "I am 6' 2\" tall.",
    "One time I received a letter addressed to \"Hate Dimick\". I did not respond.",
    "I did a polar plunge once.",
    "I don't use TikTok or Instagram and I never used Vine.",
    "Someday I want a lake house.",
    "My favorite cut of steak is filet mignon, but I also love the deckle on a ribeye.",
    "My favorite programming languages are Go, Python, and Svelte (Svelte is a framework, I know, but it makes working with UIs so much better than vanilla JS)",
    "I really don't like to rewatch movies or replay video games.",
    "My favorite song is Everlong.",
    "I've never been arrested or ticketed.",
    "Lemonade is good but Arnie Palmies and strawberry lemonade are better.",
    "I'm pretty bad at lying.",
    "If I notice a 4 or 5 digit license plate, I feel the urge to point it out.",
    "I've lost more money investing in Draftkings than betting in Draftkings.",
    "I'm afraid of food delivery services and how I might become addicted to them if I start using them.",
    "I've never tried to use a pogo stick"
]